import pandas as pd
import random

# Загрузка данных из файла CSV
df = pd.read_csv('datasetTemas\dataset1.csv')



# Функция для добавления случайных слов в сообщение
def add_random_words(message):
    random_words = [
    "яблоко", "книга", "парк", "солнце", "медведь", "дом", "телефон", "школа", "машина", "пианино",
    "кот", "окно", "дерево", "футбол", "красота", "море", "носок", "картина", "чашка", "кровать",
    "космос", "гитара", "компьютер", "снег", "кофе", "собака", "фильм", "газета", "конфета", "птица",
    "дверь", "планета", "музыка", "зонт", "звезда", "трава", "ручка", "бумага", "рыба", "фонарь",
    "парень", "девушка", "человек", "луна", "палец", "земля", "шапка", "платье", "ноутбук", "цветок",
    "банан", "деревня", "фотоаппарат", "река", "магазин", "деньги", "книжка", "стол", "телефон", "радуга",
    "дорога", "карта", "девочка", "парта", "собака", "суп", "муха", "сумка", "карандаш", "лампа",
    "конь", "стул", "слон", "рука", "лес", "гора", "поезд", "кафе", "печка", "корабль",
    "фонарик", "пирог", "телевизор", "бутылка", "диск", "видео", "стена", "микрофон", "двор", "мышь",
    "заяц", "собака", "лестница", "поле", "фрукты", "крыша", "бабушка", "телефон", "космонавт", "попугай"
    ]
    num_words_to_add = random.randint(1, 5)  # Генерируем случайное количество слов для вставки
    for _ in range(num_words_to_add):
        random_word = random.choice(random_words)  # Выбираем случайное слово из списка
        message += ' ' + random_word  # Добавляем его в сообщение
    return message

# Применение функции к каждому сообщению в датасете
df['message'] = df['message'].apply(add_random_words)

# Сохранение измененного датасета в файл CSV
df.to_csv('dataset_with_random_words.csv', index=False)
